#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.test_repo will be created
  + resource "github_repository" "test_repo" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Wow look ! A repo"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "newfoundland-repo"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
    }

  # github_repository_file.Pull_Request_Template will be created
  + resource "github_repository_file" "Pull_Request_Template" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + content             = <<-EOT
            ***IMPORTANT: Please do not create a Pull Request without creating an issue first.**
            
            *Any change needs to be discussed before proceeding. Failure to do so may result in the rejection of the pull request.*
            
            Please provide enough information so that others can review your pull request:
            
            <!-- You can skip this if you're fixing a typo or adding an app to the Showcase. -->
            
            Explain the **details** for making this change. What existing problem does the pull request solve?
            
            <!-- Example: When "Adding a function to do X", explain why it is necessary to have a way to do X. -->
            
            **Test plan (required)**
            
            Demonstrate the code is solid. Example: The exact commands you ran and their output, screenshots / videos if the pull request changes UI.
            
            <!-- Make sure tests pass on both Travis and Circle CI. -->
            
            **Code formatting**
            
            <!-- See the simple style guide. -->
            
            **Closing issues**
            
            Put `closes #XXXX` in your comment to auto-close the issue that your PR fixes (if such).
        EOT
      + file                = "pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "jolly-good-repo"
      + sha                 = (known after apply)
    }

  # github_repository_file.prtemplate will be created
  + resource "github_repository_file" "prtemplate" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = (known after apply)
      + content             = <<-EOT
            **IMPORTANT: Please do not create a Pull Request without creating an issue first.**
            
            *Any change needs to be discussed before proceeding. Failure to do so may result in the rejection of the pull request.*
            
            Please provide enough information so that others can review your pull request:
            
            <!-- You can skip this if you're fixing a typo or adding an app to the Showcase. -->
            
            Explain the **details** for making this change. What existing problem does the pull request solve?
            
            <!-- Example: When "Adding a function to do X", explain why it is necessary to have a way to do X. -->
            
            **Test plan (required)**
            
            Demonstrate the code is solid. Example: The exact commands you ran and their output, screenshots / videos if the pull request changes UI.
            
            <!-- Make sure tests pass on both Travis and Circle CI. -->
            
            **Code formatting**
            
            <!-- See the simple style guide. -->
            
            **Closing issues**
            
            Put `closes #XXXX` in your comment to auto-close the issue that your PR fixes (if such).
        EOT
      + file                = "pull_request_template.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "newfoundland-repo"
      + sha                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @agf46, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Actions`*